%初始化参数
n=1.7;  %螺旋桨转速rps
w=0.25; %伴流系数
t=0.16; %推力减额分数
% Pmax=33000000; %主机最大持续功率 W
% PS=0.85*Pmax;  %主机功率 W
% P_D=0.98*1*PS; %螺旋桨敞水收到功率 W
Q=2.547E6;       %螺旋桨收到转矩
den=1025.91;   %海水密度 kg/m^3
Result=zeros(40131,8); %
k=0;
%%------------最大航速计算------------%%
%计算出每种组合对应的kt，kq，eff
for EAR=0.5:0.05:0.8 %伸张面比 7个
    for D=7.5:0.05:8.5 %直径 21个
        for Vs=21:0.2:25 %航速 21个
            for m=1:13
                PD=0.1*m+0.3;%螺距比 pitch ratio 共13个
                J=0.5144*(1-w)*Vs/(n*D); %计算进速系数J
                [Kt, Kq]=calKtKq(J, EAR, PD);%计算推力系数Kt,转矩系数Kq
                eta0 = (Kt./Kq)*(J/(2*pi));   %计算敞水效率eta0
                Result(m+k,1)=EAR;      %计算结果矩阵第一列是伸张面比
                Result(m+k,2)=D;        %第二列是直径
                Result(m+k,3)=Vs;       %第三列是航速
                Result(m+k,4)=J;        %第四列是进速系数
                Result(m+k,5)=PD;       %第五列是螺距比
                Result(m+k,6)=Kt;       %第六列是推力系数
                Result(m+k,7)=Kq;       %第七列是转矩系数
                Result(m+k,8)=eta0;     %第八列是敞水效率
            end
            k=k+13;
        end
    end
end

%%-------通过插值确定满足设计功率要求（即：螺旋桨要求的扭矩与设计功率
%%与转速下的收到转矩平衡）的螺距及相应的有效推力与敞水效率)--------%%
PD_req = findPD(Result, Q, den, n);

%%--------对每个直径，根据阻力曲线及不同航速下的有效推力值，通过插值
%%确定有效推力与阻力平衡的航速，以及对应的螺距和敞水效率----------%%
Vs_req = findVs(PD_req,den,n,w,t);
output = findD(Vs_req);